% pathfortesting.m
%--------------------------------------------------------------------------
% Verzió: 1.0
% A szkriptfájl célja:
% Ez a fájl elore definiált nyomvonalakat tartalmaz. A koordináták egysége 1 m.
% A path01..14 nyomvonalak egyetlen célja a nyomvonalrajzolás és
% a mindenféle görbék AGV általi követésének tesztelése.
%--------------------------------------------------------------------------
path1  = [[0;0;0], [0.0;+0.50;0]];% Simple line
path2  = [[0;0;0], [0.0;+0.50;0], [+0.50;+0.50;0]];% Turn to upwards   right  - (-90°).
path3  = [[0;0;0], [0.0;+0.50;0], [-0.50;+0.50;0]];% Turn to upwards   left   - (+90°).
path4  = [[0;0;0], [0.0;-0.50;0], [+1.00;-0.50;0]];% Turn to downwards right  - (+90°).
path5  = [[0;0;0], [0.0;-0.50;0], [-1.00;-0.50;0]];% Turn to downwards left   - (-90°).
path6  = [[0;0;0], [0.0;+0.50;0], [+2.00;+2.50;0]];% Turn to upwards   right  - (-45°).
path7  = [[0;0;0], [0.0;+0.50;0], [-1.00;+1.50;0]];% Turn to upwards   left   - (+45°).
path8  = [[0;0;0], [0.0;-0.50;0], [+1.00;-1.50;0]];% Turn to downwards right  - (+45°).
path9  = [[0;0;0], [0.0;-0.50;0], [-1.00;-1.50;0]];% Turn to downwards left   - (-45°).
path10 = [[0;0;0], [0.0;+1.00;0], [-1.00;+0.50;0]];% Turn to down back left  - (+135°).
path11 = [[0;0;0], [0.0;+1.00;0], [+0.50;+0.50;0]];% Turn to down back left  - (-135°).
path12 = [[0;0;0], [0.0;-1.00;0], [-0.50;-0.50;0]];% Turn to up back   left  - (-135°).
path13 = [[0;0;0], [0.0;-1.00;0], [+0.50;-0.50;0]];% Turn to up back   right - (+135°).
path14 = [[0;0;0], [0.10;0.10;0], [0.50;0.50;0], [1.00;0.50;0], [1.00;1.00;0], [0.50;1.00;0], [0.50;1.50;0], [1.00;1.50;0], [1.50;2.00;0]]; % Összetett nyomvonal.
path15 = [[0;0;0], [1.00;0.00;0], [1.00;1.00;0], [0.00;1.00;0], [0;0;0]]; % Négyzet. Összetett pálya a nem-kör alakú hurok követésének tesztelésére. Ez a "TESZT" nyomvonal.
path16 = [[0;0;0], [2.00;0.00;0], [2.0;1.0;0], [3.0;1.0;0], [3.0;2.0;0], [2.0;2.0;0], [1.0;2.0;0], [1.0;1.0;0], [0.0;1.0;0], [0.0;0.0;0]];
path17 = [[0;0;0], [0.40;0.00;0], [0.4;0.4;0], [0.0;0.4;0], [0.0;0.0;0]]; % Kör.
path18 = [[0;0;0], [0.0;+0.40;0], [+2.00;+0.40;0]];% Turn to upwards right - sharp. Long straight end to test stabilization.
path19 = [[0;0;0], [1;0;0], [1;0.5;0], [2;0.5;0], [2;0;0], [3;0;0], [3;1;0], [2;1;0], [2;1.5;0], [1;1.5;0], [1;1;0], [0;1;0], [0;0;0]]; % Az AGV szakdolgozatba szánt pályája.
path20 = [[1;0;0], [2;0;0], [2;1;0], [3;1;0], [3;2;0], [2;2;0], [2;3;0], [1;3;0], [1;2;0], [0;2;0], [0;1;0], [1;1;0], [1;0;0]]; % Görög kereszt.
path21 = [[0;0;0],[2;0;0],[2;1;0],[3;1;0],[3;2;0],[4;2;0],[4;3;0],[5;3;0],[5;4;0],[3;4;0],[3;3;0],[2;3;0],[2;2;0],[1;2;0],[1;1;0],[0;1;0],[0;0;0]]; % Duplalépcsö.